[
  {
    "id": 1,
    "title": "Coffee Shop Receipt",
    "description": "Achieng’ runs a small café in Kisumu. At the end of each sale, she wants a program that asks for the prices of items purchased and then prints the total bill along with tax.",
    "domain": "Business"
  },
  {
    "id": 2,
    "title": "Train Ticket Calculator",
    "description": "Kamau is building a ticket system for the Nairobi–Mombasa SGR. The program should take a passenger’s age and distance of travel, then calculate the fare (children get 50% off, seniors get 30% off).",
    "domain": "Transport"
  },
  {
    "id": 3,
    "title": "Student Grader",
    "description": "Wanjiru is a teacher in Nakuru who spends hours grading. She wants a program where she enters a student’s marks, and the program prints their grade (A, B, C, etc.).",
    "domain": "Education"
  },
  {
    "id": 4,
    "title": "Password Checker",
    "description": "Otieno often sets weak passwords and forgets them. He wants a program that asks the user to enter a password and checks if it is at least 8 characters long. If not, the program should warn him.",
    "domain": "Security"
  },
  {
    "id": 5,
    "title": "Temperature Converter",
    "description": "Chebet is traveling to the U.S. and struggles with Fahrenheit vs Celsius. She wants a small program where she can type a temperature in Celsius and get it converted to Fahrenheit (and vice versa).",
    "domain": "Utility"
  },
  {
    "id": 6,
    "title": "Number Guessing Game",
    "description": "Mwangi is bored while waiting in traffic. He wants a program that randomly picks a number between 1 and 100, and the user has to guess it. The program should give hints ('too high' or 'too low').",
    "domain": "Entertainment"
  },
  {
    "id": 7,
    "title": "Bank ATM Simulator",
    "description": "Amina is designing a mini ATM system for her ICT class project. She wants a program that lets users check balance, deposit money, and withdraw money (with checks so balance never goes negative).",
    "domain": "Finance"
  },
  {
    "id": 8,
    "title": "Shopping Cart Discount",
    "description": "Mutiso is setting up an online shop for farm produce. He wants a program that takes the total cost of items and applies a discount (10% if the total is over KSh 10,000).",
    "domain": "Business"
  },
  {
    "id": 9,
    "title": "Multiplication Table Printer",
    "description": "Njeri is helping her younger brother with math homework. She needs a program that prints the multiplication table of any number the user enters.",
    "domain": "Education"
  },
  {
    "id": 10,
    "title": "To-Do List Manager",
    "description": "Barasa wants a simple console-based to-do list to organize his farm chores. The program should let him add tasks, view all tasks, and mark tasks as done.",
    "domain": "Productivity"
  },
  {
    "id": 11,
    "title": "M-Pesa Transaction Tracker",
    "description": "Kiplagat runs a small shop in Eldoret. He wants a program that records daily M-Pesa transactions and shows the total money received and spent at the end of the day.",
    "domain": "Finance"
  },
  {
    "id": 12,
    "title": "County Tax Calculator",
    "description": "Wanjiku is a boda boda rider in Nyeri. She wants a program that calculates her daily income and deducts county tax at 5%.",
    "domain": "Finance"
  },
  {
    "id": 13,
    "title": "Loan Interest Calculator",
    "description": "Omolo borrowed money from a SACCO. He needs a program that calculates how much he will owe after a given number of months, based on interest rate.",
    "domain": "Finance"
  },
  {
    "id": 14,
    "title": "Salary Slip Generator",
    "description": "Atieno just got a new job. She wants a program that, given her gross salary, calculates NHIF, NSSF, and PAYE deductions, then shows her net pay.",
    "domain": "Finance"
  },
  {
    "id": 15,
    "title": "Matatu Fare Calculator",
    "description": "Moraa is a matatu conductor in Kisii. She wants a program that calculates the total fare collected depending on the number of passengers and distance traveled.",
    "domain": "Transport"
  },
  {
    "id": 16,
    "title": "Fuel Efficiency Tracker",
    "description": "Mutua drives a taxi in Nairobi. He wants a program where he enters kilometers driven and fuel consumed, and it calculates his car’s fuel efficiency.",
    "domain": "Transport"
  },
  {
    "id": 17,
    "title": "Parking Fee System",
    "description": "Njenga manages a parking lot in Nairobi CBD. He needs a program that charges cars KSh 50 for the first hour and KSh 20 for each additional hour.",
    "domain": "Transport"
  },
  {
    "id": 18,
    "title": "School Fees Payment System",
    "description": "Achieng’ is a school bursar. She wants a program where parents can enter the amount paid, and it shows the remaining balance.",
    "domain": "Education"
  },
  {
    "id": 19,
    "title": "Exam Average Calculator",
    "description": "Mwikali wants to know her overall grade. She needs a program that takes marks from different subjects and calculates the average score.",
    "domain": "Education"
  },
  {
    "id": 20,
    "title": "Library Fine Calculator",
    "description": "Otieno borrowed books from the library. The program should calculate fines (KSh 10 per day late).",
    "domain": "Education"
  },
  {
    "id": 21,
    "title": "Maize Harvest Estimator",
    "description": "Chebet grows maize in Kericho. She wants a program that estimates total bags harvested based on the number of acres and yield per acre.",
    "domain": "Agriculture"
  },
  {
    "id": 22,
    "title": "Milk Collection System",
    "description": "Koech runs a dairy farm. He needs a program that records daily liters of milk collected and calculates total income for the month based on price per liter.",
    "domain": "Agriculture"
  },
  {
    "id": 23,
    "title": "Poultry Egg Tracker",
    "description": "Naliaka keeps chickens. She wants a program that records the number of eggs collected each day and shows the weekly total.",
    "domain": "Agriculture"
  },
  {
    "id": 24,
    "title": "BMI Calculator",
    "description": "Amina is a fitness coach in Mombasa. She wants a program that takes weight and height, then calculates and classifies BMI (underweight, normal, overweight).",
    "domain": "Health"
  },
  {
    "id": 25,
    "title": "Hospital Queue System",
    "description": "Omondi is a receptionist at a Kisumu clinic. He wants a program that stores patient names and displays them in the order they registered.",
    "domain": "Health"
  },
  {
    "id": 26,
    "title": "Water Intake Reminder",
    "description": "Mutheu wants to stay hydrated. She needs a program that asks her weight, then calculates how many liters of water she should drink per day.",
    "domain": "Health"
  },
  {
    "id": 27,
    "title": "Karaoke Song Picker",
    "description": "Mwangi loves karaoke. He wants a program that randomly selects a song from a list whenever he types 'next'.",
    "domain": "Entertainment"
  },
  {
    "id": 28,
    "title": "Quiz Game",
    "description": "Njeri wants to practice for her KCSE. She needs a program that asks multiple-choice questions and shows her score at the end.",
    "domain": "Education"
  },
  {
    "id": 29,
    "title": "Birthday Countdown",
    "description": "Barasa wants to know how many days remain until his next birthday. The program should calculate and display this.",
    "domain": "Entertainment"
  },
  {
    "id": 30,
    "title": "Shopping Basket Calculator",
    "description": "Wekesa is shopping at Naivas. He wants a program that takes the prices of items and calculates the total, applying a discount if the total exceeds KSh 5,000.",
    "domain": "Business"
  },
  {
    "id": 31,
    "title": "Electricity Bill Estimator",
    "description": "Mutinda wants to budget his monthly bills. He needs a program that calculates the cost based on the number of units consumed (tiered pricing).",
    "domain": "Utility"
  },
  {
    "id": 32,
    "title": "Water Bill Calculator",
    "description": "Owino lives in Kisumu. He wants a program that calculates his water bill depending on cubic meters consumed and fixed charges.",
    "domain": "Utility"
  },
  {
    "id": 33,
    "title": "Football Score Tracker",
    "description": "Omondi coaches a village football team. He wants a program that records goals scored by each player and prints the match summary.",
    "domain": "Sports"
  },
  {
    "id": 34,
    "title": "Athletics Timer",
    "description": "Cherono participates in athletics. She wants a program that records the time taken to run a race and compares it to her personal best.",
    "domain": "Sports"
  },
  {
    "id": 35,
    "title": "Market Price Monitor",
    "description": "Moraa sells vegetables in Kisii Market. She wants a program that stores daily prices of tomatoes and onions, then shows price trends.",
    "domain": "Business"
  },
  {
    "id": 36,
    "title": "Bus Seat Booking System",
    "description": "Kamau runs a bus company. He wants a program that allows passengers to book available seats and marks them as reserved.",
    "domain": "Transport"
  },
  {
    "id": 37,
    "title": "Garbage Collection Scheduler",
    "description": "Njeri manages waste collection for her estate. She wants a program that schedules collection days and alerts residents.",
    "domain": "Environment"
  },
  {
    "id": 38,
    "title": "Tree Planting Tracker",
    "description": "Mutiso is part of a green initiative. He wants a program that records how many trees each participant plants and gives a monthly total.",
    "domain": "Environment"
  },
  {
    "id": 39,
    "title": "Rainfall Data Analyzer",
    "description": "Chebet is a geography student. She wants a program that takes daily rainfall measurements and calculates weekly and monthly averages.",
    "domain": "Environment"
  },
  {
    "id": 40,
    "title": "National ID Validator",
    "description": "Wekesa is building an app for government services. He wants a program that checks if a Kenyan ID number entered is valid (8 digits).",
    "domain": "Government"
  },
  {
    "id": 41,
    "title": "County Service Rating",
    "description": "Achieng’ wants to collect feedback about county services. She needs a program where citizens can enter ratings from 1 to 5, then calculates the average rating.",
    "domain": "Government"
  },
  {
    "id": 42,
    "title": "Polling Station Vote Counter",
    "description": "Otieno is an election clerk. He needs a program that records votes for candidates and displays the winner at the end of counting.",
    "domain": "Government"
  },
  {
    "id": 43,
    "title": "Church Tithe Calculator",
    "description": "Mutheu is a church treasurer. She wants a program that calculates tithe as 10% of a member’s income and tracks monthly contributions.",
    "domain": "Community"
  },
  {
    "id": 44,
    "title": "Mosque Attendance Tracker",
    "description": "Omar manages a mosque in Mombasa. He wants a program that records daily attendance and shows trends during the week.",
    "domain": "Community"
  },
  {
    "id": 45,
    "title": "Wedding Guest List Manager",
    "description": "Naliaka is organizing her wedding. She wants a program where she can add guests, remove names, and print the final guest list.",
    "domain": "Lifestyle"
  },
  {
    "id": 46,
    "title": "Chama Contribution Tracker",
    "description": "Wanjiru is the treasurer of her chama group. She wants a program that records member contributions and shows total savings.",
    "domain": "Finance"
  },
  {
    "id": 47,
    "title": "Farm Equipment Rental System",
    "description": "Koech rents out tractors in Kericho. He wants a program that records rentals, charges per hour, and calculates total income.",
    "domain": "Agriculture"
  },
  {
    "id": 48,
    "title": "Tea Picking Tracker",
    "description": "Cheruiyot manages tea pickers. He wants a program that records kilograms picked by each worker and calculates daily wages.",
    "domain": "Agriculture"
  },
  {
    "id": 49,
    "title": "Fish Market Sales Calculator",
    "description": "Amina sells fish at Kongowea Market. She wants a program that records different fish sales and calculates daily profit.",
    "domain": "Business"
  },
  {
    "id": 50,
    "title": "Bus Timetable Reminder",
    "description": "Mutua commutes daily from Kitengela. He wants a program that reminds him of bus departure times and alerts him if he is late.",
    "domain": "Transport"
  },
  {
    "id": 51,
    "title": "Clinic Medicine Stock",
    "description": "Mwikali manages a small clinic. She wants a program that records medicine stock, updates when medicines are given out, and alerts when stock is low.",
    "domain": "Health"
  },
  {
    "id": 52,
    "title": "Blood Donation Tracker",
    "description": "Barasa volunteers at a blood drive. He wants a program that records donor names, blood types, and quantities donated.",
    "domain": "Health"
  },
  {
    "id": 53,
    "title": "School Attendance Register",
    "description": "Wekesa is a head teacher. He wants a program that records student attendance and generates a monthly attendance report.",
    "domain": "Education"
  },
  {
    "id": 54,
    "title": "Hostel Room Allocator",
    "description": "Otieno is a hostel manager at a college. He wants a program that assigns students to available rooms and marks them as occupied.",
    "domain": "Education"
  },
  {
    "id": 55,
    "title": "Music Playlist Organizer",
    "description": "Njeri loves music. She wants a program that stores her favorite songs, allows her to add or remove songs, and play them in order.",
    "domain": "Entertainment"
  },
  {
    "id": 56,
    "title": "Movie Ticket Booking",
    "description": "Kamau manages a cinema in Nairobi. He wants a program that lets customers book available seats for different movies.",
    "domain": "Entertainment"
  },
  {
    "id": 57,
    "title": "Cooking Recipe Book",
    "description": "Achieng’ wants a digital recipe book. She needs a program that stores recipes with ingredients and steps, then allows her to search by recipe name.",
    "domain": "Lifestyle"
  },
  {
    "id": 58,
    "title": "Online Poll Creator",
    "description": "Mutiso runs a blog. He wants a program that creates polls with multiple options and displays results after users vote.",
    "domain": "Community"
  },
  {
    "id": 59,
    "title": "Savings Goal Tracker",
    "description": "Wanjiku is saving for a new boda boda. She wants a program that records savings deposits and shows progress toward her goal.",
    "domain": "Finance"
  },
  {
    "id": 60,
    "title": "Weather Forecast Logger",
    "description": "Kiplagat is studying climate patterns. He wants a program that records daily weather forecasts and compares predicted vs actual outcomes.",
    "domain": "Environment"
  },
  {
    "id": 61,
    "title": "M-Pesa Statement Generator",
    "description": "Otieno wants a program that stores all his M-Pesa transactions in a file and generates a monthly statement showing deposits, withdrawals, and balances.",
    "domain": "Finance"
  },
  {
    "id": 62,
    "title": "Matatu Route Planner",
    "description": "Kamau owns a matatu company. He wants a program that stores multiple routes with stages and fares, then calculates the cheapest route for a given start and destination.",
    "domain": "Transport"
  },
  {
    "id": 63,
    "title": "Secondary School Timetable Generator",
    "description": "Wanjiru is a deputy principal. She wants a program that automatically creates a weekly timetable by allocating teachers to classes without time conflicts.",
    "domain": "Education"
  },
  {
    "id": 64,
    "title": "Sacco Loan Management System",
    "description": "Chebet is the manager of a SACCO. She needs a program that keeps track of loans given to members, calculates monthly repayments, and generates reports of outstanding balances.",
    "domain": "Finance"
  },
  {
    "id": 65,
    "title": "Hospital Patient Record System",
    "description": "Amina manages a private clinic. She wants a program that allows her to register patients, assign doctors, and retrieve medical history from stored records.",
    "domain": "Health"
  },
  {
    "id": 66,
    "title": "County Revenue Collection System",
    "description": "Mutiso works for the county government. He wants a program that records payments for licenses, parking, and permits, then produces daily revenue summaries.",
    "domain": "Government"
  },
  {
    "id": 67,
    "title": "Inventory Management System for a Shop",
    "description": "Barasa owns a hardware shop. He wants a program that stores products with quantities, updates stock when items are sold, and generates low-stock alerts.",
    "domain": "Business"
  },
  {
    "id": 68,
    "title": "E-Voting Simulation",
    "description": "Njeri is building a demo for electronic voting. She wants a program that allows registered voters to log in, cast their vote, and displays real-time results securely.",
    "domain": "Government"
  },
  {
    "id": 69,
    "title": "Farm Irrigation Scheduler",
    "description": "Koech uses drip irrigation for his farm. He wants a program that schedules irrigation times based on weather forecasts and soil moisture data.",
    "domain": "Agriculture"
  },
  {
    "id": 70,
    "title": "Traffic Camera Fine System",
    "description": "Mwangi works with NTSA. He wants a program that stores car registration numbers, records speeding violations, and automatically calculates fines.",
    "domain": "Transport"
  },
  {
    "id": 71,
    "title": "Kenyan Stock Portfolio Tracker",
    "description": "Omondi invests in the Nairobi Securities Exchange. He wants a program that stores shares owned, updates values based on market prices, and shows profit or loss.",
    "domain": "Finance"
  },
  {
    "id": 72,
    "title": "Bus Reservation System with Multiple Buses",
    "description": "Achieng’ runs a bus company. She wants a program that manages seat reservations for multiple buses, prevents double booking, and prints tickets.",
    "domain": "Transport"
  },
  {
    "id": 73,
    "title": "Kenyan Census Data Analyzer",
    "description": "Mutheu is a statistician. She wants a program that reads census data from a file, then computes population per county, gender ratios, and average household size.",
    "domain": "Government"
  },
  {
    "id": 74,
    "title": "University Course Registration System",
    "description": "Wekesa is an IT administrator at a university. He wants a program that allows students to register for courses, ensures prerequisites are met, and prevents timetable clashes.",
    "domain": "Education"
  },
  {
    "id": 75,
    "title": "Hospital Pharmacy Management",
    "description": "Mwikali is in charge of a hospital pharmacy. She wants a program that keeps track of medicines dispensed to patients, manages expiry dates, and generates usage reports.",
    "domain": "Health"
  },
  {
    "id": 76,
    "title": "Agricultural Market Price API",
    "description": "Kiplagat is building an app for farmers. He wants a program that fetches daily crop prices (like maize and beans) from an API, stores them, and provides averages per week.",
    "domain": "Agriculture"
  },
  {
    "id": 77,
    "title": "National Exam Results System",
    "description": "Otieno is tasked with managing KCSE exam data. He wants a program that imports student results, computes performance per subject, and ranks schools by average score.",
    "domain": "Education"
  },
  {
    "id": 78,
    "title": "Online Bookstore System",
    "description": "Naliaka runs a small online bookshop. She wants a program that stores book inventory, handles customer orders, processes payments, and generates receipts.",
    "domain": "Business"
  },
  {
    "id": 79,
    "title": "Smart Traffic Light Controller",
    "description": "Mutua works on a smart city project. He wants a program that simulates traffic lights, adjusts timing based on traffic density, and prioritizes emergency vehicles.",
    "domain": "Transport"
  },
  {
    "id": 80,
    "title": "Kenyan Passport Application System",
    "description": "Amina works in the immigration department. She wants a program that allows applicants to register, upload documents, and tracks application status until approval.",
    "domain": "Government"
  },
  {
    "id": 81,
    "title": "Secure M-Pesa Backup System",
    "description": "Otieno wants a program that saves his daily M-Pesa transactions into a local file but encrypts the file using AES so that no one else can read it without a password.",
    "domain": "Finance"
  },
  {
    "id": 82,
    "title": "Weather Data Downloader",
    "description": "Chebet is building a farming app. She wants a program that connects to a public weather API, downloads the forecast for her county, and stores it in a CSV file.",
    "domain": "Agriculture"
  },
  {
    "id": 83,
    "title": "Encrypted Student Report System",
    "description": "Wanjiru is a teacher who prepares student reports. She wants a program that writes each student’s report card to a file and encrypts the file before emailing it.",
    "domain": "Education"
  },
  {
    "id": 84,
    "title": "Secure File Sharing Between Offices",
    "description": "Mutiso works for a county office. He wants a program that allows sending files over the network between branches and encrypts them during transfer.",
    "domain": "Government"
  },
  {
    "id": 85,
    "title": "Hospital Patient Data Backup",
    "description": "Amina manages a private hospital. She wants a program that automatically writes patient records to a backup file daily and encrypts it before uploading to a secure server.",
    "domain": "Health"
  },
  {
    "id": 86,
    "title": "Matatu GPS Location Broadcaster",
    "description": "Kamau owns a fleet of matatus. He wants a program that sends the live GPS location of each matatu to a central server every 10 seconds for tracking.",
    "domain": "Transport"
  },
  {
    "id": 87,
    "title": "Online Exam Submission System",
    "description": "Mwikali is setting up online exams. She wants a program where students submit answers over the network, and the answers are saved into encrypted files on the server.",
    "domain": "Education"
  },
  {
    "id": 88,
    "title": "Kenya Power Smart Meter Logger",
    "description": "Mutua works at Kenya Power. He wants a program that collects data from smart meters via a network connection, logs usage into files, and encrypts customer data for security.",
    "domain": "Utility"
  },
  {
    "id": 89,
    "title": "Encrypted Chama Communication App",
    "description": "Njeri is part of a chama group. She wants a program that allows members to send text messages over the network, but all messages should be encrypted before sending.",
    "domain": "Community"
  },
  {
    "id": 90,
    "title": "File-Based Voting System with Encryption",
    "description": "Omondi is developing a demo for electronic voting. He wants a program where votes are sent over the network, stored in files, and each file is encrypted for security.",
    "domain": "Government"
  },
{
"id": 91,
"title": "Distributed Matatu Tracking System",
"description": "Kamau owns a large fleet of matatus across Nairobi. He wants a distributed system where each matatu sends its GPS location to a central server, which updates a live dashboard accessible via a REST API.",
"domain": "Transport"
},
{
"id": 92,
"title": "Blockchain-Based Land Registry",
"description": "Otieno works at the Ministry of Lands. He wants a blockchain-based Java application that records land ownership transactions securely and allows verification via a public ledger API.",
"domain": "Government"
},
{
"id": 93,
"title": "Real-Time Stock Exchange Simulator",
"description": "Omondi is teaching finance students. He wants a multi-threaded Java program that simulates the Nairobi Securities Exchange with concurrent buyers and sellers, updating prices in real-time.",
"domain": "Finance"
},
{
"id": 94,
"title": "AI-Powered Crop Disease Detector",
"description": "Chebet is an agricultural researcher. She wants a Java program that integrates with a machine learning model to analyze crop images uploaded by farmers, then returns predictions via a REST API.",
"domain": "Agriculture"
},
{
"id": 95,
"title": "National Health Records System",
"description": "Amina is part of a government ICT team. She wants a Java application that integrates with a database cluster to store patient records, synchronizes across hospitals, and provides secure access with role-based authentication.",
"domain": "Health"
},
{
"id": 96,
"title": "Smart Traffic Simulation with Multithreading",
"description": "Mutua is designing a smart city project. He wants a multi-threaded Java program that simulates hundreds of cars moving through Nairobi’s intersections, controlled by adaptive traffic lights that minimize congestion.",
"domain": "Transport"
},
{
"id": 97,
"title": "Kenyan Census Big Data Processor",
"description": "Wanjiru works with KNBS. She wants a Java program that processes massive census datasets using Hadoop/Spark APIs, computes population statistics per county, and outputs the data in dashboards.",
"domain": "Government"
},
{
"id": 98,
"title": "High-Performance M-Pesa Fraud Detection System",
"description": "Kiplagat is developing a fraud monitoring tool. He wants a Java application that consumes transaction streams in real-time using Apache Kafka, applies fraud detection rules, and raises alerts.",
"domain": "Finance"
},
{
"id": 99,
"title": "Distributed University E-Learning Platform",
"description": "Mwikali is setting up an online university platform. She wants a Java system that supports video streaming, handles thousands of concurrent users with load balancing, and provides APIs for exams and grading.",
"domain": "Education"
},
{
"id": 100,
"title": "End-to-End Encrypted Messaging Service",
"description": "Njeri is building a Kenyan alternative to WhatsApp. She wants a Java system that supports real-time chat with WebSockets, stores chat history in distributed databases, and uses RSA + AES for end-to-end encryption.",
"domain": "Community"
}
]
